# FailureHandlingOptions Properties

---
The FailureHandlingOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace